app/controllers/emails_controller.rb

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-02-28 15:21:41.358759"], ["id", 7]]
---
  def show
    respond_to do |format|
      format.html
      format.js
      @email = Email.find(params[:id])
      @email.read = true
      @email.save

INSERT INTO "emails" ("object", "body", "read", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["object", "jte baise"], ["body", "yes yes yes"], ["read", false], ["created_at", "2019-02-28 22:14:19.267104"], ["updated_at", "2019-02-28 22:14:19.267104"]]
---
  def create
    @email = Email.new(email_params)

    respond_to do |format|
      if @email.save

DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 1]]
---
  def destroy
    @email.destroy

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_email
      @email = Email.find(params[:id])