app/controllers/users_controller.rb

  def show
    @tasks = Task.all
    @categories = Category.all
---
SELECT "categories".* FROM "categories"